Revit 2027 API
CableTrayType.IsValidBendMultiplier Method
 Identifies if the input bend multiplier is valid.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidBendMultiplier(
	double bendMultiplier
)
Public Function IsValidBendMultiplier (
	bendMultiplier As Double
) As Boolean
public:
bool IsValidBendMultiplier(
	double bendMultiplier
)
member IsValidBendMultiplier :
        bendMultiplier : float -> bool
Parameters
bendMultiplier Double
 The bend multiplier to check.
Return Value
Boolean
 True if the value is acceptable, false otherwise.
See Also
Reference
CableTrayType Class
Autodesk.Revit.DB.Electrical Namespace